# -*- coding: utf-8 -*-
"""Pz_11_1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1vNT9CC7_Wx0I7tboMnYVLRCGRmUg-dGr

Задача 1 (3 практическая)
"""

# Дано целое положительное число
# Проверить истинность высказывания: "Данное число является четным двузначным"

while True: # обработка исключений
    try:
        a = int(input("Введите целое число: "))
        if 10 < a < 100 and (a % 2) == 0:
            print("Истинно")
        else:
            print("Ложно")
    except ValueError:
        print("Введены неверные данные")

"""Задача 2 (4 практическая)"""

#Дано целое число N
#Используя один цикл, найти сумму 1 + 1/(1!) + 1/(2!) + 1/(3!) + ... +1/(N!)
while True: #Обработка исключений
    try:
        N = int(input("Введите N: "))
        break
    except ValueError:
        print("Неверный формат")
factorial = 1
summ = 1
i = 1
while i <= N:
    factorial *= i
    num = 1/factorial
    i= i+1
    summ+=num
print(round(summ,1))

"""Задача 3 ( 5 практическая)"""

# Составить программу, в которой функция построит изображение
# В котором в первой строке 1 звездочка, во второй - 2, в третьей -3, ..., в строке с номером m - m звездочек.
def picture(n, i=1):
    while i <= n:
        pic = (i *'*')
        i = i+1
        print(pic)
lines = int(input("Введите количество строк: "))
picture(lines)