# Дана строка.
# Преобразовать в ней все строчные буквы(как латинские, так и русские) в прописные.
stroka = input("Введите фразу на русском или на англиском: ")
print(stroka.upper()) # upper меняет все малые символы на большие
